server/test/load-test.yaml
config:
  target: "ws://localhost:8080" # Адрес вашего сервера
  phases:
    - duration: 60 # Длительность теста в секундах
      arrivalRate: 10 # Создавать 10 новых пользователей в секунду
      rampTo: 100 # Плавно увеличить нагрузку до 100 пользователей/сек
scenarios:
  - engine: ws
    flow:
      - send: "Привет от теста!" # Отправить сообщение
      - think: 1 # Подождать 1 секунду
      - send: "Второе сообщение"